#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>
#include "test.h"

#define BITCHANGE(n) ((((n) & 0x55555555) << 1) + (((n) & 0xaaaaaaaa) >> 1))
int main()
{
	int a = 10;
	int b = BITCHANGE(a);
	printf("%d\n", b);

	//00000000000000000000000000001010
	//00000000000000000000000000000101
	//10101010101010101010101010101010
	//0xaaaaaaaa

	//01010101010101010101010101010101
	//0x55555555
	//00000000000000000000000000000101

}

//
//int main()
//{
//	printf("%d\n", g_val);
//
//	return 0;
//}
//int main()
//{
//	//000000000000000000000000010
//	//001001010100000000000000111
//	//111111111111111111111111101
//
//	unsigned char i = 7;
//	//7 4 1 254 251 ....5 2 255 252 3 0 
//	int j = 0;
//	for (; i>0; i -= 3)
//	{
//		++j;
//	}
//	printf("%d\n", j);
//	return 0;
//}
//
//struct One{
//	double d;//0-7
//	char c;//8
//	//9-11
//	int i;//12-15
//}//16
//
//struct One{
//	double d;//0-7
//	char c;//8
//	//9-11
//	int i;//12-15
//}//16
//
//
//struct Two{
//	char c;//0
//	//1-3
//	double d;//4-11
//	int i;//12-15
//}//16
//
//struct Two{
//	char c;//0
//	//1-7
//	double d;//8-15
//	int i;//16-19
//	//19-23
//}//24s
//
//
//int x = 1;
//do{
//	printf("%2d\n", x++);//1 x=2
//} while (x--);//x=1
//
//#include<stdio.h>
//#include<stdlib.h>
//void main()
//{
//	int a = -3;
//	//10000000000000000000000000000011
//	//11111111111111111111111111111100
//	//11111111111111111111111111111101
//
//	unsigned int b = 2;
//	//00000000000000000000000000000010
//	long c = a + b;
//	//11111111111111111111111111111101
//	//00000000000000000000000000000010
//	//11111111111111111111111111111111
//	printf("%ld\n", c);
//}
//
//char *p[] = { "Shanghai", "Beijing", "Honkong" };
//
//A.*p[1] + 3
//B.*(p[1] + 3)
//C.*(p[3] + 1)
//D.p[3][1]
//
//
//int f(int x)
//{
//return ((x>2) ? x*f(x - 1) : 3);
//}
//int i;
//i = f(3) :
//
//int p[][4] = { { 1 }, { 3, 2 }, { 4, 5, 6 }, { 0 } }
//1 0 0 0
//3 2 0 0
//4 5 6 0
//0 0 0 0 
//p[1][2]
//
//int fun(int a){
//	a ^= (1 << 5) - 1;
//	return a;
//}
//
//fun(21)
//21 ^= (1 << 5) - 1
//21 ^= 32 - 1
//21 ^ 31
//010101
//011111
//001010
//10


//#define MAX 100
//const int max = 100;
//
//#define N 
//#define Y(n) 
//则执行语句 z = 2 * （ 3 + 1 + ((5) * 5 + 1) ）后， z 的值为


//53
//1 1 2 3 5 8 13 21 34 55

//#define INT_PTR int*
//typedef int* int_ptr;
//
//typedef struct Stu
//{
//	char name[20];
//	int age;
//}S;
//
//INT_PTR a, b;
//int *a, b;
//int_ptr c, d;
//



